trade_exp/src/InformationRegisters/АкадемияДолжностьЗакрепленныйМатериал/АкадемияДолжностьЗакрепленныйМатериал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d04c1c6b-da88-46a3-b255-b2897c5793f2">
  <name>АкадемияДолжностьЗакрепленныйМатериал</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="db7fd2de-e975-4a26-8287-2442dfc0a706">
    <name>ЕстьГлавныйИМиниТест</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="17343571-4ca2-47b8-bf12-7274ea517341">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="34621758-0823-45e5-bf7e-a7b5d3912c6b">
    <name>Тема</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="5757745b-8f1a-4997-9107-850ac532beb6">
    <name>Отдел</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/АкадемияДолжностьЗакрепленныйМатериал/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТемыАкадемии.Ссылка КАК ТипТемы
		|ПОМЕСТИТЬ ВТ_ТипыТем
		|ИЗ
		|	Справочник.ТемыАкадемии КАК ТемыАкадемии
		|ГДЕ
		|	(ТемыАкадемии.Наименование = ""Инструкции и стандарты""
		|			ИЛИ ТемыАкадемии.Наименование = ""Изучение ассортимента"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АкадемияДолжностьЗакрепленныйМатериал.Отдел КАК Отдел,
		|	АкадемияДолжностьЗакрепленныйМатериал.Должность КАК Должность,
		|	АкадемияДолжностьЗакрепленныйМатериал.Тема.ТипТемы КАК ТипТемы,
		|	ВЫБОР
		|		КОГДА АкадемияДолжностьЗакрепленныйМатериал.Тема.Родитель В
		|				(ВЫБРАТЬ
		|					ВТ_ТипыТем.ТипТемы
		|				ИЗ
		|					ВТ_ТипыТем)
		|			ТОГДА АкадемияДолжностьЗакрепленныйМатериал.Тема
		|	КОНЕЦ КАК ГруппаТемы
		|ПОМЕСТИТЬ ВТ_ГруппыТем
		|ИЗ
		|	РегистрСведений.АкадемияДолжностьЗакрепленныйМатериал КАК АкадемияДолжностьЗакрепленныйМатериал
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ГруппыТем.Отдел КАК Отдел,
		|	ВТ_ГруппыТем.Должность КАК Должность,
		|	ВТ_ГруппыТем.ТипТемы КАК ТипТемы,
		|	ВТ_ГруппыТем.ГруппаТемы КАК ГруппаТемы,
		|	АкадемияДолжностьЗакрепленныйМатериал.Тема КАК Тема
		|ПОМЕСТИТЬ ВТ_Темы
		|ИЗ
		|	ВТ_ГруппыТем КАК ВТ_ГруппыТем
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АкадемияДолжностьЗакрепленныйМатериал КАК АкадемияДолжностьЗакрепленныйМатериал
		|		ПО ВТ_ГруппыТем.ГруппаТемы = АкадемияДолжностьЗакрепленныйМатериал.Тема.Родитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Темы.Отдел КАК Отдел,
		|	ВТ_Темы.Должность КАК Должность,
		|	ВТ_Темы.ТипТемы КАК ТипТемы,
		|	ВТ_Темы.ГруппаТемы КАК ГруппаТемы,
		|	ВТ_Темы.Тема КАК Тема,
		|	АкадемияДолжностьЗакрепленныйМатериал.Тема КАК Подтема
		|ИЗ
		|	ВТ_Темы КАК ВТ_Темы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АкадемияДолжностьЗакрепленныйМатериал КАК АкадемияДолжностьЗакрепленныйМатериал
		|		ПО ВТ_Темы.Тема = АкадемияДолжностьЗакрепленныйМатериал.Тема.Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Отдел,
		|	Должность,
		|	ТипТемы,
		|	ГруппаТемы,
		|	Тема,
		|	Подтема
		|ИТОГИ ПО
		|	Отдел,
		|	Должность";
	
    ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "ТЗ");
	
КонецПроцедуры
